; domain
(define (domain rover)
    (:requirements :strips :typing)
    (:types
        rover waypoint store camera mode lander objective
    )

    (:predicates
        (at ?x - rover ?y - waypoint)
        (at_lander ?x - lander ?y - waypoint)
        (can_traverse ?r - rover ?x - waypoint ?y - waypoint)
        (equipped_for_soil_analysis ?r - rover)
        (equipped_for_rock_analysis ?r - rover)
        (equipped_for_imaging ?r - rover)
        (empty ?s - store)
        (have_rock_analysis ?r - rover ?w - waypoint)
        (have_soil_analysis ?r - rover ?w - waypoint)
        (full ?s - store)
        (calibrated ?c - camera ?r - rover)
        (supports ?c - camera ?m - mode)
        (visible ?w - waypoint ?p - waypoint)
        (have_image ?r - rover ?o - objective ?m - mode)
        (communicated_soil_data ?w - waypoint)
        (communicated_rock_data ?w - waypoint)
        (communicated_image_data ?o - objective ?m - mode)
        (at_soil_sample ?w - waypoint)
        (at_rock_sample ?w - waypoint)
        (visible_from ?o - objective ?w - waypoint)
        (store_of ?s - store ?r - rover)
        (calibration_target ?i - camera ?o - objective)
        (on_board ?i - camera ?r - rover)
    )

    (:action navigate
        :parameters (?x - rover ?y - waypoint ?z - waypoint)
        :precondition (and
            (can_traverse ?x ?y ?z)
            (at ?x ?y)
            (visible ?y ?z))
        :effect (and
            (not (at ?x ?y))
            (at ?x ?z))
    )

    (:action sample_soil
        :parameters (?x - rover ?s - store ?p - waypoint)
        :precondition (and
            (at ?x ?p)
            (at_soil_sample ?p)
            (equipped_for_soil_analysis ?x)
            (store_of ?s ?x)
            (empty ?s))
        :effect (and
            (not (empty ?s))
            (full ?s)
            (have_soil_analysis ?x ?p)
            (not (at_soil_sample ?p)))
    )

    (:action sample_rock
        :parameters (?x - rover ?s - store ?p - waypoint)
        :precondition (and
            (at ?x ?p)
            (at_rock_sample ?p)
            (equipped_for_rock_analysis ?x)
            (store_of ?s ?x)
            (empty ?s))
        :effect (and
            (not (empty ?s))
            (full ?s)
            (have_rock_analysis ?x ?p)
            (not (at_rock_sample ?p)))
    )

    (:action drop
        :parameters (?x - rover ?y - store)
        :precondition (and
            (store_of ?y ?x)
            (full ?y))
        :effect (and
            (not (full ?y))
            (empty ?y))
    )

    (:action calibrate
        :parameters (?r - rover ?i - camera ?t - objective ?w - waypoint)
        :precondition (and
            (equipped_for_imaging ?r)
            (calibration_target ?i ?t)
            (at ?r ?w)
            (visible_from ?t ?w)
            (on_board ?i ?r))
        :effect (and
            (calibrated ?i ?r))
    )

    (:action take_image
        :parameters (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
        :precondition (and
            (calibrated ?i ?r)
            (on_board ?i ?r)
            (equipped_for_imaging ?r)
            (supports ?i ?m)
            (visible_from ?o ?p)
            (at ?r ?p))
        :effect (and
            (have_image ?r ?o ?m)
            (not (calibrated ?i ?r)))
    )

    (:action communicate_soil_data
        :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
        :precondition (and
            (at ?r ?x)
            (at_lander ?l ?y)
            (have_soil_analysis ?r ?p)
            (visible ?x ?y))
        :effect (and
            (communicated_soil_data ?p))
    )

    (:action communicate_rock_data
        :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
        :precondition (and
            (at ?r ?x)
            (at_lander ?l ?y)
            (have_rock_analysis ?r ?p)
            (visible ?x ?y))
        :effect (and
            (communicated_rock_data ?p))
    )

    (:action communicate_image_data
        :parameters (?r - rover ?l - lander ?o - objective ?m - mode ?x - waypoint ?y - waypoint)
        :precondition (and
            (at ?r ?x)
            (at_lander ?l ?y)
            (have_image ?r ?o ?m)
            (visible ?x ?y))
        :effect (and
            (communicated_image_data ?o ?m))
    )
)

; problem
(define (problem rover-04)
   (:domain rover)
   (:objects
      general - lander
      colour high_res low_res - mode
      rover1 - rover
      rover1store - store
      waypoint1 waypoint2 waypoint3 waypoint4 - waypoint
      camera1 - camera
      objective1 objective2 - objective
   )
   (:init
      (at_lander general waypoint2)
      (at rover1 waypoint1)
      (equipped_for_soil_analysis rover1)
      (equipped_for_rock_analysis rover1)
      (equipped_for_imaging rover1)
      (empty rover1store)
      (store_of rover1store rover1)
      (at_rock_sample waypoint1)
      (at_rock_sample waypoint2)
      (at_rock_sample waypoint4)
      (at_soil_sample waypoint1)
      (at_soil_sample waypoint4)
      (visible waypoint2 waypoint4)
      (visible waypoint1 waypoint2)
      (visible waypoint2 waypoint1)
      (visible waypoint3 waypoint1)
      (visible waypoint4 waypoint2)
      (visible waypoint1 waypoint3)
      (visible waypoint2 waypoint3)
      (visible waypoint3 waypoint2)
      (visible waypoint1 waypoint4)
      (visible waypoint4 waypoint1)
      (can_traverse rover1 waypoint2 waypoint4)
      (can_traverse rover1 waypoint1 waypoint2)
      (can_traverse rover1 waypoint2 waypoint1)
      (can_traverse rover1 waypoint3 waypoint1)
      (can_traverse rover1 waypoint4 waypoint2)
      (can_traverse rover1 waypoint1 waypoint3)
      (can_traverse rover1 waypoint2 waypoint3)
      (can_traverse rover1 waypoint3 waypoint2)
      (calibration_target camera1 objective1)
      (on_board camera1 rover1)
      (supports camera1 low_res)
      (supports camera1 colour)
      (supports camera1 high_res)
      (visible_from objective1 waypoint2)
      (visible_from objective2 waypoint4)
   )
   (:goal
      (and
         (communicated_rock_data waypoint1)
         (communicated_soil_data waypoint1)
         (communicated_soil_data waypoint4)
         (communicated_image_data objective1 low_res)
         (communicated_image_data objective1 colour))
   )
)

; plan
1. (sample_soil rover1 rover1store waypoint1)
   deleted: (empty rover1store) (at_soil_sample waypoint1)
   added: (full rover1store) (have_soil_analysis rover1 waypoint1)
   goals met: 0 of 5
2. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 0 of 5
3. (communicate_soil_data rover1 general waypoint1 waypoint1 waypoint2)
   added: (communicated_soil_data waypoint1)
   goals met: 1 of 5
4. (sample_rock rover1 rover1store waypoint1)
   deleted: (empty rover1store) (at_rock_sample waypoint1)
   added: (full rover1store) (have_rock_analysis rover1 waypoint1)
   goals met: 1 of 5
5. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 1 of 5
6. (communicate_rock_data rover1 general waypoint1 waypoint1 waypoint2)
   added: (communicated_rock_data waypoint1)
   goals met: 2 of 5
7. (navigate rover1 waypoint1 waypoint2)
   deleted: (at rover1 waypoint1)
   added: (at rover1 waypoint2)
   goals met: 2 of 5
8. (calibrate rover1 camera1 objective1 waypoint2)
   added: (calibrated camera1 rover1)
   goals met: 2 of 5
9. (take_image rover1 waypoint2 objective1 camera1 colour)
   deleted: (calibrated camera1 rover1)
   added: (have_image rover1 objective1 colour)
   goals met: 2 of 5
10. (calibrate rover1 camera1 objective1 waypoint2)
   added: (calibrated camera1 rover1)
   goals met: 2 of 5
11. (take_image rover1 waypoint2 objective1 camera1 low_res)
   deleted: (calibrated camera1 rover1)
   added: (have_image rover1 objective1 low_res)
   goals met: 2 of 5
12. (navigate rover1 waypoint2 waypoint4)
   deleted: (at rover1 waypoint2)
   added: (at rover1 waypoint4)
   goals met: 2 of 5
13. (sample_soil rover1 rover1store waypoint4)
   deleted: (empty rover1store) (at_soil_sample waypoint4)
   added: (full rover1store) (have_soil_analysis rover1 waypoint4)
   goals met: 2 of 5
14. (communicate_soil_data rover1 general waypoint4 waypoint4 waypoint2)
   added: (communicated_soil_data waypoint4)
   goals met: 3 of 5
15. (communicate_image_data rover1 general objective1 colour waypoint4 waypoint2)
   added: (communicated_image_data objective1 colour)
   goals met: 4 of 5
16. (communicate_image_data rover1 general objective1 low_res waypoint4 waypoint2)
   added: (communicated_image_data objective1 low_res)
   goals met: 5 of 5
